app/Http/Controllers/Auth/LoginController.php

select * from `users` where `provider_id` = '116393531135722598938' limit 1
---
    private function findOrCreateUserGoogle($googleUser)
    {
        $authUser=User::Where('provider_id',$googleUser->id)->first();