app/Http/Controllers/Api/UserController.php

    public function findOrCreateUserFacebook(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'access_token' => 'required',
            'facebook_id' => 'required',
        ]);


        if ($validator->fails()) {
            return response()->json(['error'=>$validator->errors()], 401);
        }
        $input = $request->all();

        $client = new Client();
        $response = $client->post('https://graph.facebook.com/v3.3/'.$input['facebook_id'].'?fields=id,email,name,picture', [
                'headers' => [
                    'Content-Type' => 'application/json',
                    'Authorization' => 'Bearer ' . $input['access_token']
                ],
            ]
        );


        $facebookUserJson = json_decode($response->getBody()->getContents());
        $authUser = User::Where('provider_id',$facebookUserJson->id)->first();
---
select * from `users` where `provider_id` = '2622641081113553' limit 1