app/Http/Controllers/Api/UserController.php

    public function wallets()
    {
        $wallets = Wallet::where('id_user',Auth::id())->get();
---
select * from `wallets` where `id_user` = 8

    public function generateSCFromPaypal(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'from' => 'required',
            'to' => 'required',
            'scCurrency' => 'required',
            'email' => 'required',
            'password' => 'required',
        ]);
        $input = $request->all();
        if ($validator->fails()) {
            return response()->json(['error'=>$validator->errors()], 401);
        }
        $user = User::where('email',$input['email'])->first();
        $walletMaster = Wallet::where('num_wallet',config('app.wallet_parent_id'))->first();
        $userMaster = User::where('id',$walletMaster->id_user)->first();

        if ($user)
        {
            if($user->id == $userMaster->id)  // vérifier que le mail correspond au wallet du from
            {
                if (password_verify ( $input['password'], $user->password ))
                {
                    if(config('app.wallet_parent_id') == $input['from'])
                    {
                        $wallets = Wallet::all();
---
select * from `users` where `email` = 'julien.jagosz@gmail.com' limit 1
select * from `wallets` where `num_wallet` = 'd4735e3a265e16eee03f59718b9b5d03019c07d8b6c51f90da3a666eec13ab35' limit 1
select * from `users` where `id` = 8 limit 1
select * from `wallets`

    public function createTransaction(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'from' => 'required',
            'to' => 'required',
            'scCurrency' => 'required',
        ]);
        $input = $request->all();
        if ($validator->fails()) {
            return response()->json(['error'=>$validator->errors()], 401);
        }
        $user = Auth::user();

        $walletUser = Wallet::where('num_wallet',$input['from'])->first();
        $userWallet = User::where('id',$walletUser->id_user)->first();
        if ($user)
        {
            if($user->id == $userWallet->id)  // vérifier que le token correspond au wallet du from
            {
                    if($input['from'] == $input['from'])
                    {
                        $wallets = Wallet::all();
---
select * from `wallets` where `num_wallet` = 'sbQl8axuFNtLw' limit 1
select * from `users` where `id` = 112 limit 1
select * from `wallets`

    public function findOrCreateUserGoogle(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'access_token' => 'required',
        ]);


        if ($validator->fails()) {
            return response()->json(['error'=>$validator->errors()], 401);
        }
        $input = $request->all();

        $client = new Client();
        $response = $client->request('GET', "https://oauth2.googleapis.com/tokeninfo", [
            "query" => [
                "id_token" => $input['access_token']
            ],
        ]);

        $googleUserJson = json_decode($response->getBody()->getContents());
        $authUser = User::Where('provider_id',$googleUserJson->sub)->first();
---
select * from `users` where `provider_id` = '100821339074310444818' limit 1

    public function findOrCreateUserFacebook(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'access_token' => 'required',
            'facebook_id' => 'required',
        ]);


        if ($validator->fails()) {
            return response()->json(['error'=>$validator->errors()], 401);
        }
        $input = $request->all();

        $client = new Client();
        $response = $client->post('https://graph.facebook.com/v3.3/'.$input['facebook_id'].'?fields=id,email,name,picture', [
                'headers' => [
                    'Content-Type' => 'application/json',
                    'Authorization' => 'Bearer ' . $input['access_token']
                ],
            ]
        );


        $facebookUserJson = json_decode($response->getBody()->getContents());
        $authUser = User::Where('provider_id',$facebookUserJson->id)->first();
---
select * from `users` where `provider_id` = '2622641081113553' limit 1