app/traduire.php

function traduireSign($walletAccount, $destWalletAccount, $amount, $taxe)
{

    $private = App\Wallet::where('num_wallet',$walletAccount)->first()->private_key;
---
select * from `wallets` where `num_wallet` = 'd4735e3a265e16eee03f59718b9b5d03019c07d8b6c51f90da3a666eec13ab35' limit 1