app/Http/Controllers/BuyController.php

    public function showPayment()
    {
        $wallets = Wallet::where('id_user',Auth::id())->get();
---
select * from `wallets` where `id_user` = 8