app/Http/Controllers/SettingsController.php

select * from `wallets` where `id_user` = 38
---
    public function showSettings()
    {
        $wallets = Wallet::where('id_user',Auth::id())->get();