app/Http/Controllers/TransactionsController.php

select * from `wallets` where `id_user` = 8
---
    public function showTransactions(Request $request)
    {
        if(Session::get('dropdown_transactions') == null){
            Session::put('dropdown_transactions', 'All transactions');
        }
        if($request->post('dropdown_transactions'))
        {
            $filterBy = $request->input('dropdown_transactions');
            Session::put('dropdown_transactions', $filterBy);
        }
        $wallets = Wallet::where('id_user',Auth::id())->get();