app/Http/Controllers/WalletController.php

select * from `wallets` where `id_user` = 38
---
    public function showWallet()
    {

        $wallets = Wallet::where('id_user',Auth::id())->get();

select * from `wallets` where `num_wallet` = 'sbjRgrJnct9yI' limit 1
---
    public function showDetailWallet($walletNumber)
    {
        $client = new Client();
        $response = $client->post('xcvbn.co:11180/getSolde.php', [
            'form_params' => [
                'idWallet' => $walletNumber->num_wallet
            ]
        ]);
        $todaySold = $client->post('xcvbn.co:11180/getSoldeToday.php', [
            'form_params' => [
                'num_wallet' => $walletNumber->num_wallet
            ]
        ]);
        $response = $response->getBody()->getContents();
        $todaySold = $todaySold->getBody()->getContents();
        $walletDetails = Wallet::where('num_wallet', $walletNumber->num_wallet)->first();

select * from `wallets` where `id_user` = 1
select exists(select * from `wallets` where `name` = 'MASTER' and `id_user` = 1) as `exists`
---
    public function createNewWallet(Request $request)
    {

        if(count(App\Wallet::where('id_user',Auth::id())->get()) < 3)
        {
            if($request->post('create_wallet'))
            {
                $walletName = $request->input('wallet-new-name');
                if (strlen($walletName) > 10) {
                    return back()->with(['warning' => 'Wallet name is too long !']);
                }
                if (Wallet::where('name', '=', $request->input('wallet-new-name'))->where('id_user','=',Auth::id())->exists())

select * from `wallets`
---
    public function sendSupCash(Request $request)
    {
        if($request->post('send_supCash'))
        {
            $wallets = Wallet::all();