app/Providers/RouteServiceProvider.php

select * from `wallets` where `num_wallet` = 'sbjRgrJnct9yI' limit 1
---
    public function boot()
    {
        //
        parent::boot();
        Route::bind('walletNumber', function ($value) {
            $wallet = Wallet::where('num_wallet', $value)->firstOrFail(); // On récupère le portefeuille

            if($wallet !=null && $wallet->id_user == Auth::id()) //Si l'utilisateur connecté est le propriétaire du portefeuille
            {
                return Wallet::where('num_wallet', $value)->firstOrFail();